# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
data = [4,8,15,16,23,42]
series = pd.Series(data)
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [5]:
my_lst = [1,2,3,4,5,6,7,8,9,10]
data = pd.Series(my_lst)
data

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:
# Name
# Alice
# Bob
# Claire

# Age
# 25
# 30
# 27

# Gender
# Female
# Male
# Female

# Then, print the DataFrame.

In [6]:
data = {'Name' : ["Alice" , "Bob" , "Claire"],
        'Age' : [25,30,27],
        'Gender':["Female" , "Male", "Female"]
        }
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

# In pandas, a DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. It is similar to a spreadsheet or a SQL table. You can think of it as a collection of Series that share the same index.

# A Series, on the other hand, is a one-dimensional labeled array that can hold any data type such as integers, floats, strings, etc. It is similar to a column in a spreadsheet or a SQL table.

# Here is an example that shows the differnce between a Dataframe and a Series.

In [7]:
data = {'Name' : ["Alice" , "Bob" , "Claire"],
        'Age' : [25,30,27],
        'Gender':["Female" , "Male", "Female"]
        }
df = pd.DataFrame(data)
age_series = df ['Age']
print(df)
print(age_series)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
0    25
1    30
2    27
Name: Age, dtype: int64

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
type(age_series)

pandas.core.series.Series

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

# head(): This function returns the first n rows of the DataFrame. It is useful when you want to get a quick preview of the data.

In [10]:
df.head(1)

    Name  Age  Gender
0  Alice   25  Female

# tail(): This function returns the last n rows of the DataFrame. It is useful when you want to see the end of the data.

In [11]:
df.tail(1)

     Name  Age  Gender
2  Claire   27  Female

# info(): This function provides a summary of the DataFrame, including the number of non-null values in each column and the data types of each column.

In [12]:
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie', 'Dave'], 
                   'Age': [25, 30, 35, 40],
                   'City': ['London', 'New York', 'Paris', 'Sydney']})
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

# Both Series and DataFrame are mutable in nature, whereas Panel is considered to be deprecated and has been replaced by the multi-index DataFrame, which is also mutable in nature.

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [14]:
s1 = pd.Series([1, 2, 3, 4], name='A')
s2 = pd.Series(['apple', 'banana', 'cherry', 'date'], name='B')
s3 = pd.Series([10.0, 20.0, 30.0, 40.0], name='C')

# create a DataFrame from the Series
df = pd.DataFrame({'A': s1, 'B': s2, 'C': s3})

df.reshape(4,3)

AttributeError: 'DataFrame' object has no attribute 'reshape'